#define _CRT_SECURE_NO_WARNINGS 1

/*#include<stdio.h>
int main()
{
	//c语言类型
	//1内置类型
	//char short int long float double
	//unsigned 无符号 signed 有符号
	//最高位是符号位 如果是0正 1就是负
	//如果不是符号位 最高位是有效位
	//2自定义类型(构造类型)
	//数组类型
	//结构体类型 struct
	//枚举类型   enum
	//联合类型   union
	//3指针类型
	//4空类型
	//void
	//int a=10;//4
	//float f=10.0;//4
	//int a=20;//4个字节
	//正数 原反补一样
	//00000000 00000000 00000000 000010100 原
	//00000000 00000000 00000000 000010100 反
	//00000000 00000000 00000000 000010100 补
	//四个二进制位变为一个十六进制位
	//0x00000014
	//倒着存
	//int b=-10;
	//负数 原码 反码是原码符号位不变 按位取反 补码=反码加1
	//10000000 00000000 00000000 000001010 原
	//11111111 11111111 11111111 111110101 反
	//11111111 11111111 11111111 111110110 补
	//FFFFFFF6
	//四个一是15 十六进制是F
	//倒着存
	//存的是补码 课件有原因
	//1+(-1)
	//1的补码
	//000000000000000000000001
	//-1的补码
	//111111111111111111111111
	//相加
	//1000000000000000000000000
	//第三十三位丢弃 最多存储32位
	//000000000000000000000000
	//结果为0
	//大端模式
	//0x11223344 11 22 33 44正着存 低位是最右边位 高地址正在右边
	//小端模式
	//0x11223344 44 33 22 11倒着存
	return 0;
}*/

//写一段代码告诉我们当前机器的字节序是什么

/*#include<stdio.h>
check_sys()
{
	/*int a=1;
	char *p=(char*)&a;//存放地址 解引用只拿一个字节
	/*if(*p==1)
		return 1;
	else
		return 0;*/
		//优化成返回*p
		//return *p; 
		//返回1 小端
		//返回0 大端
		//再优化 
		/*int a=1;
		return *(char*)&a;
		//指针类型的意义
		//1 指针类型决定了指针解引用操作符能访问几个字节
		//2 指针类型决定了指针+1 -1 到底加的 减的是几个字节
	}*/

	/*int main()
	{
		int ret=check_sys();
		if(ret==1)
		{
			printf("小端\n");
		}
		else
		{
			printf("大端\n");
		}
		return 0;
	} */


	//练习
	//1.
	//输出什么？
	/*#include <stdio.h>
	int main()
	{
		char a= -1;
		//-1原码:10000000 00000000 00000000 00000001
		//-1反码:11111111 11111111 11111111 11111110
		//-1的补码是全1
		//char截断
		//a:11111111
		//整型提升
		//补符号位 1
		//补码:11111111111111111111111111111111111
		//存的是补码 打印原码 还是-1
		signed char b=-1;
		//b:11111111
		//同a
		unsigned char c=-1;
		//c:11111111 无符号位补0
		//补码:0000000000000011111111
		//正数 原反补相同
		//打印原码 255
		printf("a=%d,b=%d,c=%d",a,b,c);
		return 0;
	}*/

	//2.
	/*#include <stdio.h>
	int main()
	{
		char a = -128;
		//-128原码:1000000000010000000
		//-128反码:0111111111101111111
		//-128补码:0111111111110000000
		//char截断:10000000
		//%u打印10进制无符号位
		//char整型提升 补符号位 补1
		//整型提升后,还是补码:1111111111111111110000000
		//因为打印无符号数
		//原码就是补码
		//所以打印一个很大的数
		printf("%u\n",a);
		return 0;
	}*/

	//有符号char范围-128到127 补码反推原码 
	//无符号char范围0到255    补码就是原码 

	//3.
	/*#include <stdio.h>
	int main()
	{
		char a = 128;
		printf("%u\n",a);
		return 0;
		//原00000001000000
		//补00000001000000
		//10000000截断
		//0000000001000000提升 补
		//0000000001000000原
		//128存不下
		//看成127+1 补码加1 最后是-128
		//所以和第2题结果一样
	} */

	//4.
	//int i= -20;
	//unsigned  int  j = 10;
	//printf("%d\n", i+j); 
	//按照补码的形式进行运算，最后格式化成为有符号整数
	//-20
	//1000000000000010100
	//1111111111111101011
	//1111111111111101100补

	//10
	//0000000000000001010补

	//1111111111111110110结果补 
	//1111111111111110101反 
	//1000000000000001010原
	//-10 

	//5.
	//unsigned int i;
	//for(i = 9; i >= 0; i--)
	//{
	//    printf("%u\n",i);
	//}
	//9 8 7 6 5 4 3 2 1 0 -1 -2 死循环
	//当-1为无符号数时 符号位算进去 最后结果很大 
	//i是无符号数 永远为正 死循环

	//6.
	/*#include<stdio.h>
	int main()
	{
		char a[1000];
		int i;
		for(i=0; i<1000; i++)
		{
			a[i] = -1-i;//-1到-1000
		}
		//char有符号 -127到128
		//当-129时 看成-128-1 等于127
		//后面都是这样 最后都是-128-127之间的数字
		//strlen找\0 -129对应127 一直减到0
		//128+127=255
		printf("%d",strlen(a));
		return 0;
	}*/

	//7.
	//#include <stdio.h>
	//unsigned char i = 0;
	//int main()
	//{
	//    for(i = 0;i<=255;i++)
	//   {
	//        printf("hello world\n");
	//   }
	//    return 0;
	//}
	//死循环
	//因为unsigned char范围是0-255
	//255+1=0

	//int main()
	//{
	//	double d=1E10;
	//	printf("%lf\n",d); 
	//	return 0;
	//}
	//
	//int main()
	//{
	//	int n = 9;
	//	//0 00000000 0000000000000000001001-补码
	//	float *pFloat = (float *)&n; 
	//	printf("n的值为：%d\n",n);//9 
	//	printf("*pFloat的值为：%f\n",*pFloat);//0.000000 E全为0 
	//	//(-1)^0*0.0000000000000000000001001*2^-126
	//	*pFloat = 9.0;
	//	//1001.0
	//	//1.001*2^3
	//	//(-1)^0*1.001*2^3
	//	//S=0 M=1.001 E=3
	//	//0 10000010 00100000000000000-补 也是原码 
	//	printf("num的值为：%d\n",n);//
	//	printf("*pFloat的值为：%f\n",*pFloat);
	//	return 0;
	//}
	//9.0
	//1001.0
	//(-1)^0      *1.001  *2^3 小数点移动
	//(-1)^s      *M      *2^E 形式
	//s=0
	//M=1.001
	//E=3
	//
	//0.5
	//二进制0.1
	//(-1)^0*1*2^(-1)
	//s=0
	//M=1.0
	//E=-1
	//float加127 E+127存入=126
	//
	//5.5
	//101.1
	//(-1)^0*1.011*2^2
	//s=-1
	//M=1.011
	//E=2
	//符号位0
	//2+127=129 10000001二进制序列 
	//再放小数位 011 
	//后面补0
	//0100 0000 1011 0000 0000 0000 0000 0000
	//16进制0x40b00000

	//1十进制数转化成二进制数
	//2写成标准形式 得到S M E
	//3先确定符号位 符号位后面存E float加个127存 double加个1023存 存的时候写成二进制
	//4再放M小数位
	//5最后补0
	//6分成4个一组 变为十六进制

	//第一位是符号位
	//后面八位是E(float) 后面二十三位是E(double) 
	//最后面是M

	//顺着来
	//反过来也要会
	//特殊情况看课件
	//E为全0
	//0 0000000 011000000
	//+/- 0.011*2^-126
	//表示无穷小

	//E为全1
	//0 1111111 011000000
	//E+127=255
	//E=128
	//1.xxx*2^128
	//表示无穷大